doc/per-interface-method/SecuritySyncComplete.json

[
{"id":3,"stamp":"2025-08-10_21-44-32-217860000","direction":">","data":"POST /DataConnector.asmx HTTP/1.1\r\nUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 4.0.30319.42000)\r\nContent-Type: text/xml; charset=utf-8\r\nSOAPAction: \"http://tempuri.org/SecuritySyncComplete\"\r\nHost: localhost:1582\r\nContent-Length: 2164\r\nExpect: 100-continue\r\n\r\n"},
{"id":3,"stamp":"2025-08-10_21-44-32-217861000","direction":"<","data":"HTTP/1.1 100 Continue\r\n\r\n"},
{"id":3,"stamp":"2025-08-10_21-44-32-217932000","direction":">","data":"<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><SecuritySyncComplete xmlns=\"http://tempuri.org/\"><conn><account>admin</account><password>admin</password><scrubAllData>true</scrubAllData><connectionId>3</connectionId><sourceSite>connectors</sourceSite><customparam>http://100.115.192.75:8080/</customparam><customparam2 /><customboolparam>false</customboolparam><customboolparam2>false</customboolparam2><customboolparam3>false</customboolparam3><customboolparam4>false</customboolparam4><customparam3 /><customparam4 /><customchoiceval /><customchoiceval2 /><customchoiceval3 /><customchoiceval4 /><BoolParameter><BoolPair><key>customboolparam</key><value /><Key>customboolparam</Key><Value>false</Value></BoolPair><BoolPair><key>customboolparam2</key><value /><Key>customboolparam2</Key><Value>false</Value></BoolPair><BoolPair><key>customboolparam3</key><value /><Key>customboolparam3</Key><Value>false</Value></BoolPair><BoolPair><key>customboolparam4</key><value /><Key>customboolparam4</Key><Value>false</Value></BoolPair></BoolParameter><StringParameter><StringPair><key>customparam</key><value>http://100.115.192.75:8080/</value><Key>customparam</Key><Value>http://100.115.192.75:8080/</Value></StringPair><StringPair><key>customparam2</key><value /><Key>customparam2</Key><Value /></StringPair><StringPair><key>customparam3</key><value /><Key>customparam3</Key><Value /></StringPair><StringPair><key>customparam4</key><value /><Key>customparam4</Key><Value /></StringPair></StringParameter><ChoiceParameter><ChoicePair><key>customchoiceval</key><value /><Key>customchoiceval</Key><Value /></ChoicePair><ChoicePair><key>customchoiceval2</key><value /><Key>customchoiceval2</Key><Value /></ChoicePair><ChoicePair><key>customchoiceval3</key><value /><Key>customchoiceval3</Key><Value /></ChoicePair><ChoicePair><key>customchoiceval4</key><value /><Key>customchoiceval4</Key><Value /></ChoicePair></ChoiceParameter></conn><tl>Warning</tl></SecuritySyncComplete></soap:Body></soap:Envelope>"},
{"id":3,"stamp":"2025-08-10_21-44-32-217933000","direction":"<","data":"HTTP/1.1 200 OK\r\nCache-Control: private, max-age=0\r\nContent-Type: text/xml; charset=utf-8\r\nServer: Microsoft-IIS/10.0\r\nX-AspNet-Version: 4.0.30319\r\nX-Powered-By: ASP.NET\r\nDate: Sun, 10 Aug 2025 21:44:31 GMT\r\nContent-Length: 437\r\n\r\n<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><SecuritySyncCompleteResponse xmlns=\"http://tempuri.org/\"><SecuritySyncCompleteResult><error>false</error><errorMsg /><traceInfo /></SecuritySyncCompleteResult></SecuritySyncCompleteResponse></soap:Body></soap:Envelope>"}
]